app/controllers/stories_controller.rb

  def index
    @story = Story.all
---
SELECT "stories".* FROM "stories"