app/controllers/stories_controller.rb

SELECT  "stories".* FROM "stories"  WHERE (#<Story::ActiveRecord_Relation:0x52f65a8>) LIMIT 1
---
  def show
  	@story = Story.find(params[:id])

SELECT  "stories".* FROM "stories"  WHERE "stories"."id" = ? LIMIT 1  [["id", 1]]
---
  def edit
    @story = Story.find(params[:id])

SELECT  "stories".* FROM "stories"  WHERE "stories"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "stories" ("created_at", "parent_id", "text", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", "2014-11-26 08:31:26.805955"], ["parent_id", 1], ["text", "Mmbrú se fue a la guerra"], ["updated_at", "2014-11-26 08:31:26.805955"]]
---
  def add_continuation
    @parent = Story.find(params[:id])
    @story = @parent.children.build story_params

    if @story.save

INSERT INTO "stories" ("created_at", "text", "title", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", "2014-11-17 14:48:57.290659"], ["text", "sdffffffffffffffffffffffffffffffffff"], ["title", "asdfasdfasdf"], ["updated_at", "2014-11-17 14:48:57.290659"]]
---
  def create
  	@story = Story.new story_params

  	if @story.save

SELECT  "stories".* FROM "stories"  WHERE "stories"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "stories" SET "text" = ?, "updated_at" = ? WHERE "stories"."id" = 1  [["text", "hola hola"], ["updated_at", "2014-11-26 10:56:15.611926"]]
---
  def update
    @story = Story.find(params[:id])
    if @story.update(story_params)